# Document Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TemporaryGraphicsCommandData..::..Document Property
TemporaryGraphicsCommandData Class See Also
---
The document.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public Document Document { get; internal set; }
```

Visual Basic
---
```text
Public Property Document As Document
	Get
	Friend Set
```

Visual C++
---
```text
public:
property Document^ Document {
	Document^ get ();
	internal: void set (Document^ value);
}
```

# See Also
TemporaryGraphicsCommandData Class
Autodesk.Revit.UI Namespace